Tekla Open API Reference for Tekla Structures 2025
ViewMarkSymbolAttributes Constructor
Overload List
Name | Description
View.ViewMarkSymbolAttributes()
 Creates a new mark symbol attributes instance.
View.ViewMarkSymbolAttributes(Double, MarkSymbolShape, View.LabelLineLengthType, Double)
 Creates a new mark symbol attributes instance with the given size, shape, line length type and line length.
Top
See Also
Reference
View.ViewMarkSymbolAttributes Class
Tekla.Structures.Drawing Namespace